import { IconAdd } from "@consta/icons/IconAdd";
import { IconChatStroked } from "@consta/icons/IconChatStroked";

export const gptData = [
  {
    id: 1,
    icon: IconAdd,
    name: "Новый чат",
    msgTime: "20 декабря в 20:50",
  },
  {
    id: 2,
    icon: IconChatStroked,
    name: "Геология",
    gptMsg:
      "Привет! Нефть - это природный ресурс, который представляет собой жидкость, состоящую из углеводородов, используемая в основном как сырье для производства бензина, дизельного топлива и других нефтепродуктов. Газ - это также углеводород, но в газообразной форме, используемый для обогрева, электроэнергии и в производстве химических продуктов.",
    userMsg: "Привет! Что такое нефть и газ?",
    msgTime: "20 декабря в 20:50",
  },
  {
    id: 3,
    icon: IconChatStroked,
    name: "Анализ сейсмики",
    gptMsg: "Привет! Завтра планируется конференция",
    userMsg: "Привет! Что такое нефть и газ?",
    msgTime: "20 декабря в 20:50",
  },
  {
    id: 4,
    icon: IconChatStroked,
    name: "Чат №1",
    gptMsg: "Привет! Завтра планируется конференция",
    userMsg: "Привет! Что такое нефть и газ?",
    msgTime: "20 декабря в 20:50",
  },
];
